## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 5 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| add    | `aws_s3_object.platform_gc_forms_gx`           |
| update | `aws_glue_job.platform_gc_forms_job`           |
|        | `aws_iam_policy.glue_etl`                      |
|        | `aws_s3_object.platform_gc_forms_job`          |
|        | `aws_s3_object.platform_gc_notify_job`         |
|        | `aws_s3_object.platform_support_freshdesk_job` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_job.platform_gc_forms_job will be updated in-place
  ~ resource "aws_glue_job" "platform_gc_forms_job" {
      ~ default_arguments         = {
          + "--additional-python-modules"        = "great_expectations==0.18.22"
          + "--gx_config_object"                 = "s3://cds-data-lake-glue-production/platform/gc_forms/gx.zip"
            # (16 unchanged elements hidden)
        }
        id                        = "Platform / GC Forms"
        name                      = "Platform / GC Forms"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.glue_etl will be updated in-place
  ~ resource "aws_iam_policy" "glue_etl" {
        id               = "arn:aws:iam::739275439843:policy/service-role/AWSGlueETL-DataLake"
        name             = "AWSGlueETL-DataLake"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action    = [
                            "kms:ReEncryptTo",
                            "kms:ReEncryptFrom",
                            "kms:GenerateDataKeyWithoutPlaintext",
                            "kms:GenerateDataKey",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Condition = {
                            "ForAnyValue:StringEquals" = {
                                "kms:ResourceAliases" = "alias/platform-notify-rds-snapshot-exports"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = "arn:aws:kms:ca-central-1:739275439843:key/*"
                        Sid       = "UseNotifyRdsExportKey"
                    },
                  ~ {
                      ~ Action   = "cloudwatch:PutMetricData" -> [
                          + "cloudwatch:PutMetricData",
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:GetMetricData",
                        ]
                      ~ Sid      = "PutCloudWatchMetrics" -> "CloudWatchMetrics"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_s3_object.platform_gc_forms_gx will be created
  + resource "aws_s3_object" "platform_gc_forms_gx" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "7c4d61938f58c4ece499e8f1e564f588"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "platform/gc_forms/gx.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/gc_forms/gx.zip"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.platform_gc_forms_job will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_forms_job" {
      ~ etag                          = "5f635c081aecd7c62468b9ed26de2dd1" -> "37310c3af92b34778e80f53a9c992016"
        id                            = "platform/gc_forms/process_data.py"
        tags                          = {}
      ~ version_id                    = "MaWMuMJpOoLxGaeqkAcOToEXj6PjnP2E" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # aws_s3_object.platform_gc_notify_job will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_job" {
      ~ etag                          = "4ca2e206574d310c7ad6219de24ffca1" -> "279fb8734de50cec5df70658275f802f"
        id                            = "platform/gc_notify/process_data.py"
        tags                          = {}
      ~ version_id                    = "9UWNbGBOSLwPHY6X9y5SmEq58gUsNjux" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # aws_s3_object.platform_support_freshdesk_job will be updated in-place
  ~ resource "aws_s3_object" "platform_support_freshdesk_job" {
      ~ etag                          = "68ed745429b3913561ac4e66bbe825d9" -> "4a7318262c50a84051bd61f4f251767b"
        id                            = "platform/support/freshdesk/process_tickets.py"
        tags                          = {}
      ~ version_id                    = "H77nVLdk1XsNKgGNFeEYE48SR42erEn1" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
